[Survived] BlockStatement
src/store/saga/authSaga.ts:6:29
 import { logout, login } from "../slices/authSlice";
 
 
-export function* authSaga() {
-  yield all([authLogoutWatcher(), authLoginWather()]);
-}
+export function* authSaga() {}
 
 function* authLogoutWatcher() {

[Survived] ArrayDeclaration
src/store/saga/authSaga.ts:7:13
 
 
 export function* authSaga() {
-  yield all([authLogoutWatcher(), authLoginWather()]);
+  yield all([]);
 }
 

[Survived] BlockStatement
src/store/saga/authSaga.ts:10:31
   yield all([authLogoutWatcher(), authLoginWather()]);
 }
 
-function* authLogoutWatcher() {
-  yield takeEvery(logout.type, authLogoutWorker);
-}
+function* authLogoutWatcher() {}
 
 function* authLogoutWorker() {

[NoCoverage] BlockStatement
src/store/saga/authSaga.ts:14:30
   yield takeEvery(logout.type, authLogoutWorker);
 }
 
-function* authLogoutWorker() {
-  yield localStorage.removeItem("userName");
-}
+function* authLogoutWorker() {}
 
 function* authLoginWather() {

[Survived] BlockStatement
src/store/saga/authSaga.ts:18:29
   yield localStorage.removeItem("userName");
 }
 
-function* authLoginWather() {
-  yield takeEvery(login.type, authLoginWorker);
-}
+function* authLoginWather() {}
 
 function* authLoginWorker() {

[Survived] BlockStatement
src/store/saga/authSaga.ts:22:29
   yield takeEvery(login.type, authLoginWorker);
 }
 
-function* authLoginWorker() {
-  const state: RootState = yield select();
-  yield localStorage.setItem("userName", state.auth.user);
-}
+function* authLoginWorker() {}
