[NoCoverage] BlockStatement
src/App.tsx:8:76
 import { useAppDispatch, useAppSelector } from "./hooks/redux.hook";
 import { LoginForm } from "./components/LoginForm/LoginForm";
 
-export const ProtectedRoute = ({ children }: { children: JSX.Element }) => {
-  return children;
-};
+export const ProtectedRoute = ({ children }: { children: JSX.Element }) => {};
 
 export const App = () => {

[NoCoverage] ArrowFunction
src/App.tsx:13:37
 };
 
 export const App = () => {
-  const { authed } = useAppSelector((state) => state.auth);
+  const { authed } = useAppSelector(() => undefined);
   const dispatch = useAppDispatch();
 

[NoCoverage] BlockStatement
src/App.tsx:16:19
   const { authed } = useAppSelector((state) => state.auth);
   const dispatch = useAppDispatch();
 
-  useEffect(() => {
-    const name = localStorage.getItem("userName");
-
-    if (name && !authed) dispatch(login(name));
-  }, [authed, dispatch]);
+  useEffect(() => {}, [authed, dispatch]);
 
   return (

[NoCoverage] ConditionalExpression
src/App.tsx:19:9
   useEffect(() => {
     const name = localStorage.getItem("userName");
 
-    if (name && !authed) dispatch(login(name));
+    if (true) dispatch(login(name));
   }, [authed, dispatch]);
 

[NoCoverage] LogicalOperator
src/App.tsx:19:9
   useEffect(() => {
     const name = localStorage.getItem("userName");
 
-    if (name && !authed) dispatch(login(name));
+    if (name || !authed) dispatch(login(name));
   }, [authed, dispatch]);
 
