[NoCoverage] ObjectLiteral
src/components/ErrorBoundary/ErrorBoundary.tsx:13:25
 }
 
 export class ErrorBoundary extends Component<Props, State> {
-  public state: State = {
-    hasError: false,
-  };
+  public state: State = {};
 
   public static getDerivedStateFromError(): State {

[NoCoverage] BooleanLiteral
src/components/ErrorBoundary/ErrorBoundary.tsx:14:15
 
 export class ErrorBoundary extends Component<Props, State> {
   public state: State = {
-    hasError: false,
+    hasError: true,
   };
 

[NoCoverage] BlockStatement
src/components/ErrorBoundary/ErrorBoundary.tsx:17:51
     hasError: false,
   };
 
-  public static getDerivedStateFromError(): State {
-    return { hasError: true };
-  }
+  public static getDerivedStateFromError(): State {}
 
   public componentDidCatch(error: Error, errorInfo: ErrorInfo) {

[NoCoverage] BooleanLiteral
src/components/ErrorBoundary/ErrorBoundary.tsx:18:24
   };
 
   public static getDerivedStateFromError(): State {
-    return { hasError: true };
+    return { hasError: false };
   }
 

[NoCoverage] BlockStatement
src/components/ErrorBoundary/ErrorBoundary.tsx:21:64
     return { hasError: true };
   }
 
-  public componentDidCatch(error: Error, errorInfo: ErrorInfo) {
-    console.error("Uncaught error:", error, errorInfo);
-  }
+  public componentDidCatch(error: Error, errorInfo: ErrorInfo) {}
 
   public render() {

[NoCoverage] BlockStatement
src/components/ErrorBoundary/ErrorBoundary.tsx:25:19
     console.error("Uncaught error:", error, errorInfo);
   }
 
-  public render() {
-    if (this.state.hasError) {
-      return <h1>Упс, похоже где то проблема!</h1>;
-    }
-
-    return this.props.children;
-  }
+  public render() {}
 }
 

[NoCoverage] ConditionalExpression
src/components/ErrorBoundary/ErrorBoundary.tsx:26:9
   }
 
   public render() {
-    if (this.state.hasError) {
+    if (true) {
       return <h1>Упс, похоже где то проблема!</h1>;
     }

[NoCoverage] BlockStatement
src/components/ErrorBoundary/ErrorBoundary.tsx:26:30
   }
 
   public render() {
-    if (this.state.hasError) {
-      return <h1>Упс, похоже где то проблема!</h1>;
-    }
+    if (this.state.hasError) {}
 
     return this.props.children;
