[NoCoverage] ArrowFunction
src/stories/LoginForm.stories.tsx:18:52
   },
 } as ComponentMeta<typeof LoginForm>;
 
-const Template: ComponentStory<typeof LoginForm> = () => (
-  <Router>
-    <Provider store={store}>
-      <LoginForm />
-    </Provider>
-  </Router>
-);
+const Template: ComponentStory<typeof LoginForm> = () => undefined;
 
 export const NormalLoginForm = Template;
