[Timeout] ArrowFunction
src/components/Field/Field.tsx:13:35
 
 const Grid = styled.div<Props>`
   display: grid;
-  grid-template-columns: repeat(${(props) => props.numCols}, 15px);
+  grid-template-columns: repeat(${() => undefined}, 15px);
   grid-template-rows: repeat(${(props) => props.numRows}, 15px);
 `;

[Survived] ArrowFunction
src/components/Field/Field.tsx:14:32
 const Grid = styled.div<Props>`
   display: grid;
   grid-template-columns: repeat(${(props) => props.numCols}, 15px);
-  grid-template-rows: repeat(${(props) => props.numRows}, 15px);
+  grid-template-rows: repeat(${() => undefined}, 15px);
 `;
 

[Killed] BlockStatement
src/components/Field/Field.tsx:17:28
   grid-template-rows: repeat(${(props) => props.numRows}, 15px);
 `;
 
-export const Field = () => {
-  const { grid, size, handleItemClick } = useGrid();
-
-  const props = {
-    numRows: size[0],
-    numCols: size[1],
-  };
-
-  return (
-    <Grid {...props} data-testid="grid">
-      {grid?.map((rows, i) =>
-        rows.map((col, k) => (
-          <FieldItem
-            data-testid={`field-item-${i}-${k}`}
-            key={`${i}-${k}`}
-            handleClick={() => {
-              handleItemClick(i, k);
-            }}
-            itemValue={grid[i][k]}
-          />
-        ))
-      )}
-    </Grid>
-  );
-};
+export const Field = () => {};
 
killedBy: test Field component render Field component
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="grid"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] OptionalChaining
src/components/Field/Field.tsx:27:8
 
   return (
     <Grid {...props} data-testid="grid">
-      {grid?.map((rows, i) =>
+      {grid.map((rows, i) =>
         rows.map((col, k) => (
           <FieldItem

[Survived] ArrowFunction
src/components/Field/Field.tsx:27:18
 
   return (
     <Grid {...props} data-testid="grid">
-      {grid?.map((rows, i) =>
-        rows.map((col, k) => (
-          <FieldItem
-            data-testid={`field-item-${i}-${k}`}
-            key={`${i}-${k}`}
-            handleClick={() => {
-              handleItemClick(i, k);
-            }}
-            itemValue={grid[i][k]}
-          />
-        ))
+      {grid?.map(() => undefined
       )}
     </Grid>

[Timeout] ArrowFunction
src/components/Field/Field.tsx:28:18
   return (
     <Grid {...props} data-testid="grid">
       {grid?.map((rows, i) =>
-        rows.map((col, k) => (
-          <FieldItem
-            data-testid={`field-item-${i}-${k}`}
-            key={`${i}-${k}`}
-            handleClick={() => {
-              handleItemClick(i, k);
-            }}
-            itemValue={grid[i][k]}
-          />
-        ))
+        rows.map(() => undefined)
       )}
     </Grid>

[Survived] StringLiteral
src/components/Field/Field.tsx:30:26
       {grid?.map((rows, i) =>
         rows.map((col, k) => (
           <FieldItem
-            data-testid={`field-item-${i}-${k}`}
+            data-testid={``}
             key={`${i}-${k}`}
             handleClick={() => {

[Survived] StringLiteral
src/components/Field/Field.tsx:31:18
         rows.map((col, k) => (
           <FieldItem
             data-testid={`field-item-${i}-${k}`}
-            key={`${i}-${k}`}
+            key={``}
             handleClick={() => {
               handleItemClick(i, k);

[NoCoverage] BlockStatement
src/components/Field/Field.tsx:32:32
           <FieldItem
             data-testid={`field-item-${i}-${k}`}
             key={`${i}-${k}`}
-            handleClick={() => {
-              handleItemClick(i, k);
-            }}
+            handleClick={() => {}}
             itemValue={grid[i][k]}
           />
