[Killed] ArrowFunction
src/components/LoginForm/LoginForm.tsx:9:37
 export const LoginForm = () => {
   const [name, setName] = useState("");
   const dispatch = useAppDispatch();
-  const { authed } = useAppSelector((state) => state.auth);
+  const { authed } = useAppSelector(() => undefined);
   const navigate = useNavigate();
 
killedBy: test LoginForm renders LoginForm component
statusReason: TypeError: Cannot read properties of undefined (reading 'authed')

[Survived] BlockStatement
src/components/LoginForm/LoginForm.tsx:12:19
   const { authed } = useAppSelector((state) => state.auth);
   const navigate = useNavigate();
 
-  useEffect(() => {
-    if (authed) navigate('/')
-  }, [authed, navigate])
+  useEffect(() => {}, [authed, navigate])
 
   const handleInput = (e: ChangeEvent<HTMLInputElement>) => {

[Survived] ConditionalExpression
src/components/LoginForm/LoginForm.tsx:13:9
   const navigate = useNavigate();
 
   useEffect(() => {
-    if (authed) navigate('/')
+    if (true) navigate('/')
   }, [authed, navigate])
 

[Survived] ConditionalExpression
src/components/LoginForm/LoginForm.tsx:13:9
   const navigate = useNavigate();
 
   useEffect(() => {
-    if (authed) navigate('/')
+    if (false) navigate('/')
   }, [authed, navigate])
 

[Survived] BlockStatement
src/components/LoginForm/LoginForm.tsx:16:61
     if (authed) navigate('/')
   }, [authed, navigate])
 
-  const handleInput = (e: ChangeEvent<HTMLInputElement>) => {
-    setName(() => e.target.value);
-  };
+  const handleInput = (e: ChangeEvent<HTMLInputElement>) => {};
 
   const handleStart = () => {

[Killed] ArrowFunction
src/components/LoginForm/LoginForm.tsx:17:13
   }, [authed, navigate])
 
   const handleInput = (e: ChangeEvent<HTMLInputElement>) => {
-    setName(() => e.target.value);
+    setName(() => undefined);
   };
 
killedBy: test LoginForm login
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Survived] BlockStatement
src/components/LoginForm/LoginForm.tsx:20:29
     setName(() => e.target.value);
   };
 
-  const handleStart = () => {
-    if (name.length > 3) {
-      dispatch(login(name));
-    }
-  };
+  const handleStart = () => {};
 
   return (

[Survived] EqualityOperator
src/components/LoginForm/LoginForm.tsx:21:9
   };
 
   const handleStart = () => {
-    if (name.length > 3) {
+    if (name.length <= 3) {
       dispatch(login(name));
     }

[Survived] EqualityOperator
src/components/LoginForm/LoginForm.tsx:21:9
   };
 
   const handleStart = () => {
-    if (name.length > 3) {
+    if (name.length >= 3) {
       dispatch(login(name));
     }

[Survived] ArrowFunction
src/components/LoginForm/LoginForm.tsx:30:21
     <div className="flex w-100 py-20 justify-center items-center">
       <div className="bg-gray-200 rounded p-3">
         <form
-          onSubmit={(e) => e.preventDefault()}
+          onSubmit={() => undefined}
           className="flex flex-col gap-5"
         >
