[Killed] BooleanLiteral
src/hooks/auth.hook.tsx:21:40
 
 export const AuthProvider = ({ children }: { children: JSX.Element }) => {
   const [user, setUser] = useState("");
-  const [authed, setAuthed] = useState(false);
+  const [authed, setAuthed] = useState(true);
   const navigate = useNavigate();
 
killedBy: should use auth
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
src/hooks/auth.hook.tsx:25:23
   const navigate = useNavigate();
 
   const login = useCallback(
-    (user: string) => {
-      setAuthed(() => true);
-      setUser(() => user);
-      localStorage.setItem("userName", user);
-      navigate("/");
-    },
+    (user: string) => {},
     [navigate]
   );
killedBy: should use auth
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ArrowFunction
src/hooks/auth.hook.tsx:26:17
 
   const login = useCallback(
     (user: string) => {
-      setAuthed(() => true);
+      setAuthed(() => undefined);
       setUser(() => user);
       localStorage.setItem("userName", user);
killedBy: should use auth
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BooleanLiteral
src/hooks/auth.hook.tsx:26:23
 
   const login = useCallback(
     (user: string) => {
-      setAuthed(() => true);
+      setAuthed(() => false);
       setUser(() => user);
       localStorage.setItem("userName", user);
killedBy: should use auth
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ArrowFunction
src/hooks/auth.hook.tsx:27:15
   const login = useCallback(
     (user: string) => {
       setAuthed(() => true);
-      setUser(() => user);
+      setUser(() => undefined);
       localStorage.setItem("userName", user);
       navigate("/");
killedBy: should use auth
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Roman"
Received: undefined

[Survived] StringLiteral
src/hooks/auth.hook.tsx:29:16
       setAuthed(() => true);
       setUser(() => user);
       localStorage.setItem("userName", user);
-      navigate("/");
+      navigate("");
     },
     [navigate]

[Survived] ArrayDeclaration
src/hooks/auth.hook.tsx:31:5
       localStorage.setItem("userName", user);
       navigate("/");
     },
-    [navigate]
+    []
   );
 

[Killed] BlockStatement
src/hooks/auth.hook.tsx:34:36
     [navigate]
   );
 
-  const logout = useCallback(() => {
-    setAuthed(() => false);
-    setUser(() => "");
-    localStorage.removeItem("userName");
-    navigate("/login");
-  }, [navigate]);
+  const logout = useCallback(() => {}, [navigate]);
 
   const value = useMemo(
killedBy: should use auth
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BooleanLiteral
src/hooks/auth.hook.tsx:35:21
   );
 
   const logout = useCallback(() => {
-    setAuthed(() => false);
+    setAuthed(() => true);
     setUser(() => "");
     localStorage.removeItem("userName");
killedBy: should use auth
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Survived] ArrowFunction
src/hooks/auth.hook.tsx:35:15
   );
 
   const logout = useCallback(() => {
-    setAuthed(() => false);
+    setAuthed(() => undefined);
     setUser(() => "");
     localStorage.removeItem("userName");

[Killed] ArrowFunction
src/hooks/auth.hook.tsx:36:13
 
   const logout = useCallback(() => {
     setAuthed(() => false);
-    setUser(() => "");
+    setUser(() => undefined);
     localStorage.removeItem("userName");
     navigate("/login");
killedBy: should use auth
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: undefined

[Killed] ArrowFunction
src/hooks/auth.hook.tsx:42:5
   }, [navigate]);
 
   const value = useMemo(
-    () => ({
-      user,
-      authed,
-      login,
-      logout,
-    }),
+    () => undefined,
     [user, authed, login, logout]
   );
killedBy: should use auth
statusReason: TypeError: Cannot read properties of undefined (reading 'authed')

[Killed] BlockStatement
src/hooks/auth.hook.tsx:54:30
   return <AuthContext.Provider value={value}>{children}</AuthContext.Provider>;
 };
 
-export const useAuth = () => {
-  return useContext(AuthContext);
-};
+export const useAuth = () => {};
 
killedBy: should use auth
statusReason: TypeError: Cannot read properties of undefined (reading 'authed')
