[Killed] BlockStatement
src/components/FieldItem/FieldItem.tsx:9:66
   itemValue: number;
 }
 
-export const FieldItem = ({ handleClick, itemValue }: IProps) => {
-  const itemStyles = classNames(
-    `d-flex w-[15px] h-[15px] border border-solid`,
-    itemValue ? "bg-pink-300" : ""
-  );
-
-  return (
-    <div
-      data-testid="field-item"
-      className={itemStyles}
-      onClick={handleClick}
-    />
-  );
-};
+export const FieldItem = ({ handleClick, itemValue }: IProps) => {};
 
killedBy: tests FieldItem component click on FieldItem component
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="field-item"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] StringLiteral
src/components/FieldItem/FieldItem.tsx:11:5
 
 export const FieldItem = ({ handleClick, itemValue }: IProps) => {
   const itemStyles = classNames(
-    `d-flex w-[15px] h-[15px] border border-solid`,
+    ``,
     itemValue ? "bg-pink-300" : ""
   );
