[Survived] BooleanLiteral
src/store/slices/authSlice.ts:5:11
 
 const initialState = {
   user: "",
-  authed: false,
+  authed: true,
 };
 

[Killed] ObjectLiteral
src/store/slices/authSlice.ts:11:13
 export const authSlice = createSlice({
   name: "auth",
   initialState,
-  reducers: {
-    login(state, { payload }: PayloadAction<string>) {      
-      state.user = payload;
-      state.authed = true;
-    },
-    logout(state) {
-        state.user = "";
-        state.authed = false;
-    },
-  },
+  reducers: {},
 });
 
killedBy: test LoginForm login
statusReason: TypeError: (0 , _authSlice.login) is not a function

[Timeout] BlockStatement
src/store/slices/authSlice.ts:12:54
   name: "auth",
   initialState,
   reducers: {
-    login(state, { payload }: PayloadAction<string>) {      
-      state.user = payload;
-      state.authed = true;
-    },
+    login(state, { payload }: PayloadAction<string>) {},
     logout(state) {
         state.user = "";

[Killed] BooleanLiteral
src/store/slices/authSlice.ts:14:22
   reducers: {
     login(state, { payload }: PayloadAction<string>) {      
       state.user = payload;
-      state.authed = true;
+      state.authed = false;
     },
     logout(state) {
killedBy: authReducer should add user if action login
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "authed": true,
+   "authed": false,

[Killed] BlockStatement
src/store/slices/authSlice.ts:16:19
       state.user = payload;
       state.authed = true;
     },
-    logout(state) {
-        state.user = "";
-        state.authed = false;
-    },
+    logout(state) {},
   },
 });
killedBy: authReducer should add user if action logout
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "authed": false,
-   "user": "",

[Killed] BooleanLiteral
src/store/slices/authSlice.ts:18:24
     },
     logout(state) {
         state.user = "";
-        state.authed = false;
+        state.authed = true;
     },
   },
killedBy: authReducer should add user if action logout
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "authed": false,
+   "authed": true,
