[Survived] ConditionalExpression
src/components/Header/Header.tsx:17:10
           <h1>Game of Life</h1>
         </div>
 
-        {authed && (
-          <div className="flex gap-2 items-center">
-            <span className="font-semibold">Hi, {user}!</span>
-            <button
-              data-testid="logout-btn"
-              className="p-1 border border-green-500 text-green-500 uppercase rounded-lg text-sm"
-              onClick={() => dispatch(logout())}
-            >
-              Log out
-            </button>
-          </div>
-        )}
+        {false}
       </div>
     </header>

[Survived] LogicalOperator
src/components/Header/Header.tsx:17:10
           <h1>Game of Life</h1>
         </div>
 
-        {authed && (
-          <div className="flex gap-2 items-center">
-            <span className="font-semibold">Hi, {user}!</span>
-            <button
-              data-testid="logout-btn"
-              className="p-1 border border-green-500 text-green-500 uppercase rounded-lg text-sm"
-              onClick={() => dispatch(logout())}
-            >
-              Log out
-            </button>
-          </div>
-        )}
+        {authed || <div className="flex gap-2 items-center">
+            <span className="font-semibold">Hi, {user}!</span>
+            <button data-testid="logout-btn" className="p-1 border border-green-500 text-green-500 uppercase rounded-lg text-sm" onClick={() => dispatch(logout())}>
+              Log out
+            </button>
+          </div>}
       </div>
     </header>

[NoCoverage] ArrowFunction
src/components/Header/Header.tsx:23:24
             <button
               data-testid="logout-btn"
               className="p-1 border border-green-500 text-green-500 uppercase rounded-lg text-sm"
-              onClick={() => dispatch(logout())}
+              onClick={() => undefined}
             >
               Log out
