[Killed] ArrayDeclaration
src/hooks/grid.hook.tsx:29:36
 export const GridContext = createContext<GridContextType>(null!);
 
 export const GridProvider = ({ children }: { children: JSX.Element }) => {
-  const [size, setSize] = useState([50, 50]);
+  const [size, setSize] = useState([]);
   const [speed, setSpeed] = useState(1000);
 
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   50,
-   50,

[Killed] ArrowFunction
src/hooks/grid.hook.tsx:32:36
   const [size, setSize] = useState([50, 50]);
   const [speed, setSpeed] = useState(1000);
 
-  const [grid, setGrid] = useState(() => generateGrid(size[0], size[1]));
+  const [grid, setGrid] = useState(() => undefined);
 
   const [running, setRunning] = useState(false);
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: Cannot read properties of undefined (reading 'slice')

[Killed] BooleanLiteral
src/hooks/grid.hook.tsx:34:42
 
   const [grid, setGrid] = useState(() => generateGrid(size[0], size[1]));
 
-  const [running, setRunning] = useState(false);
+  const [running, setRunning] = useState(true);
 
   const generateEmptyGrid = useCallback(
killedBy: Sidebar tests render UI elements
statusReason: Error: Unable to find an element with the text: /Старт/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="mx-auto flex flex-col w-[300px] gap-3 bg-slate-100 rounded-2xl p-3"

[Killed] ArrowFunction
src/hooks/grid.hook.tsx:37:19
   const [running, setRunning] = useState(false);
 
   const generateEmptyGrid = useCallback(
-    () => setGrid(() => generateGrid(size[0], size[1])),
+    () => setGrid(() => undefined),
     [size]
   );
killedBy: Sidebar tests change range Input
statusReason: TypeError: Cannot read properties of undefined (reading '23')

[Survived] ArrowFunction
src/hooks/grid.hook.tsx:37:5
   const [running, setRunning] = useState(false);
 
   const generateEmptyGrid = useCallback(
-    () => setGrid(() => generateGrid(size[0], size[1])),
+    () => undefined,
     [size]
   );

[Survived] BlockStatement
src/hooks/grid.hook.tsx:41:44
     [size]
   );
 
-  const regenerateGrid = useCallback(() => {
-    setGrid((g) =>
-      produce(g, (newGrid) => {
-        for (let i = 0; i < size[0]; i++) {
-          for (let k = 0; k < size[1]; k++) {
-            let neighbors = 0;
-            operations.forEach(([x, y]) => {
-              const newI = i + x;
-              const newK = k + y;
-              if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {
-                neighbors += g[newI][newK];
-              }
-            });
-
-            if (neighbors < 2 || neighbors > 3) {
-              newGrid[i][k] = 0;
-            } else if (g[i][k] === 0 && neighbors === 3) {
-              newGrid[i][k] = 1;
-            }
-          }
-        }
-      })
-    );
-  }, [size]);
+  const regenerateGrid = useCallback(() => {}, [size]);
 
   const getRandomInt = (max: number) => {

[Survived] ArrowFunction
src/hooks/grid.hook.tsx:42:13
   );
 
   const regenerateGrid = useCallback(() => {
-    setGrid((g) =>
-      produce(g, (newGrid) => {
-        for (let i = 0; i < size[0]; i++) {
-          for (let k = 0; k < size[1]; k++) {
-            let neighbors = 0;
-            operations.forEach(([x, y]) => {
-              const newI = i + x;
-              const newK = k + y;
-              if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {
-                neighbors += g[newI][newK];
-              }
-            });
-
-            if (neighbors < 2 || neighbors > 3) {
-              newGrid[i][k] = 0;
-            } else if (g[i][k] === 0 && neighbors === 3) {
-              newGrid[i][k] = 1;
-            }
-          }
-        }
-      })
+    setGrid(() => undefined
     );
   }, [size]);

[Survived] BlockStatement
src/hooks/grid.hook.tsx:43:31
 
   const regenerateGrid = useCallback(() => {
     setGrid((g) =>
-      produce(g, (newGrid) => {
-        for (let i = 0; i < size[0]; i++) {
-          for (let k = 0; k < size[1]; k++) {
-            let neighbors = 0;
-            operations.forEach(([x, y]) => {
-              const newI = i + x;
-              const newK = k + y;
-              if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {
-                neighbors += g[newI][newK];
-              }
-            });
-
-            if (neighbors < 2 || neighbors > 3) {
-              newGrid[i][k] = 0;
-            } else if (g[i][k] === 0 && neighbors === 3) {
-              newGrid[i][k] = 1;
-            }
-          }
-        }
-      })
+      produce(g, (newGrid) => {})
     );
   }, [size]);

[Killed] EqualityOperator
src/hooks/grid.hook.tsx:44:25
   const regenerateGrid = useCallback(() => {
     setGrid((g) =>
       produce(g, (newGrid) => {
-        for (let i = 0; i < size[0]; i++) {
+        for (let i = 0; i <= size[0]; i++) {
           for (let k = 0; k < size[1]; k++) {
             let neighbors = 0;
killedBy: Sidebar tests   
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] UpdateOperator
src/hooks/grid.hook.tsx:44:38
   const regenerateGrid = useCallback(() => {
     setGrid((g) =>
       produce(g, (newGrid) => {
-        for (let i = 0; i < size[0]; i++) {
+        for (let i = 0; i < size[0]; i--) {
           for (let k = 0; k < size[1]; k++) {
             let neighbors = 0;
killedBy: Sidebar tests   
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Survived] BlockStatement
src/hooks/grid.hook.tsx:45:45
     setGrid((g) =>
       produce(g, (newGrid) => {
         for (let i = 0; i < size[0]; i++) {
-          for (let k = 0; k < size[1]; k++) {
-            let neighbors = 0;
-            operations.forEach(([x, y]) => {
-              const newI = i + x;
-              const newK = k + y;
-              if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {
-                neighbors += g[newI][newK];
-              }
-            });
-
-            if (neighbors < 2 || neighbors > 3) {
-              newGrid[i][k] = 0;
-            } else if (g[i][k] === 0 && neighbors === 3) {
-              newGrid[i][k] = 1;
-            }
-          }
+          for (let k = 0; k < size[1]; k++) {}
         }
       })

[Timeout] UpdateOperator
src/hooks/grid.hook.tsx:45:40
     setGrid((g) =>
       produce(g, (newGrid) => {
         for (let i = 0; i < size[0]; i++) {
-          for (let k = 0; k < size[1]; k++) {
+          for (let k = 0; k < size[1]; k--) {
             let neighbors = 0;
             operations.forEach(([x, y]) => {

[Survived] BlockStatement
src/hooks/grid.hook.tsx:47:44
         for (let i = 0; i < size[0]; i++) {
           for (let k = 0; k < size[1]; k++) {
             let neighbors = 0;
-            operations.forEach(([x, y]) => {
-              const newI = i + x;
-              const newK = k + y;
-              if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {
-                neighbors += g[newI][newK];
-              }
-            });
+            operations.forEach(([x, y]) => {});
 
             if (neighbors < 2 || neighbors > 3) {

[Survived] ArithmeticOperator
src/hooks/grid.hook.tsx:48:28
           for (let k = 0; k < size[1]; k++) {
             let neighbors = 0;
             operations.forEach(([x, y]) => {
-              const newI = i + x;
+              const newI = i - x;
               const newK = k + y;
               if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {

[Survived] ArithmeticOperator
src/hooks/grid.hook.tsx:49:28
             let neighbors = 0;
             operations.forEach(([x, y]) => {
               const newI = i + x;
-              const newK = k + y;
+              const newK = k - y;
               if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {
                 neighbors += g[newI][newK];

[Killed] EqualityOperator
src/hooks/grid.hook.tsx:50:19
             operations.forEach(([x, y]) => {
               const newI = i + x;
               const newK = k + y;
-              if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {
+              if (newI < 0 && newI < size[0] && newK >= 0 && newK < size[1]) {
                 neighbors += g[newI][newK];
               }
killedBy: testing useGrid hook test start & stop simulation
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ConditionalExpression
src/hooks/grid.hook.tsx:50:32
             operations.forEach(([x, y]) => {
               const newI = i + x;
               const newK = k + y;
-              if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {
+              if (newI >= 0 && true && newK >= 0 && newK < size[1]) {
                 neighbors += g[newI][newK];
               }
killedBy: testing useGrid hook test start & stop simulation
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Survived] AssignmentOperator
src/hooks/grid.hook.tsx:51:17
               const newI = i + x;
               const newK = k + y;
               if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {
-                neighbors += g[newI][newK];
+                neighbors -= g[newI][newK];
               }
             });

[Survived] EqualityOperator
src/hooks/grid.hook.tsx:55:17
               }
             });
 
-            if (neighbors < 2 || neighbors > 3) {
+            if (neighbors >= 2 || neighbors > 3) {
               newGrid[i][k] = 0;
             } else if (g[i][k] === 0 && neighbors === 3) {

[Survived] ConditionalExpression
src/hooks/grid.hook.tsx:55:17
               }
             });
 
-            if (neighbors < 2 || neighbors > 3) {
+            if (false) {
               newGrid[i][k] = 0;
             } else if (g[i][k] === 0 && neighbors === 3) {

[Survived] EqualityOperator
src/hooks/grid.hook.tsx:57:24
 
             if (neighbors < 2 || neighbors > 3) {
               newGrid[i][k] = 0;
-            } else if (g[i][k] === 0 && neighbors === 3) {
+            } else if (g[i][k] !== 0 && neighbors === 3) {
               newGrid[i][k] = 1;
             }

[Survived] ConditionalExpression
src/hooks/grid.hook.tsx:57:24
 
             if (neighbors < 2 || neighbors > 3) {
               newGrid[i][k] = 0;
-            } else if (g[i][k] === 0 && neighbors === 3) {
+            } else if (true) {
               newGrid[i][k] = 1;
             }

[Survived] ArrayDeclaration
src/hooks/grid.hook.tsx:64:6
         }
       })
     );
-  }, [size]);
+  }, []);
 
   const getRandomInt = (max: number) => {

[Killed] BlockStatement
src/hooks/grid.hook.tsx:66:41
     );
   }, [size]);
 
-  const getRandomInt = (max: number) => {
-    return Math.floor(Math.random() * max);
-  };
+  const getRandomInt = (max: number) => {};
 
   const fillRandomCells = useCallback(
killedBy: testing useGrid hook test start & stop simulation
statusReason: TypeError: Cannot read properties of undefined (reading 'undefined')

[Killed] ArithmeticOperator
src/hooks/grid.hook.tsx:67:23
   }, [size]);
 
   const getRandomInt = (max: number) => {
-    return Math.floor(Math.random() * max);
+    return Math.floor(Math.random() / max);
   };
 
killedBy: testing useGrid hook test start & stop simulation
statusReason: RangeError: Maximum call stack size exceeded

[Survived] BlockStatement
src/hooks/grid.hook.tsx:71:26
   };
 
   const fillRandomCells = useCallback(
-    (percent: number) => {
-      const cells = Math.pow(size[0], 2);
-      const getFreeRandomCell = (length: number, grid: number[][]) => {
-        const col = getRandomInt(length);
-        const row = getRandomInt(length);
-
-        if (grid[row][col] === 1) {
-          getFreeRandomCell(length, grid);
-        }
-
-        grid[row][col] = 1;
-      };
-
-      const requiredCellsAmount = (cells / 100) * percent;
-      generateEmptyGrid();
-      setGrid((g) =>
-        produce(g, (newGrid) => {
-          for (let i = 0; i < requiredCellsAmount; i++) {
-            getFreeRandomCell(size[0], newGrid);
-          }
-        })
-      );
-    },
+    (percent: number) => {},
     [generateEmptyGrid, size]
   );

[Survived] BlockStatement
src/hooks/grid.hook.tsx:73:71
   const fillRandomCells = useCallback(
     (percent: number) => {
       const cells = Math.pow(size[0], 2);
-      const getFreeRandomCell = (length: number, grid: number[][]) => {
-        const col = getRandomInt(length);
-        const row = getRandomInt(length);
-
-        if (grid[row][col] === 1) {
-          getFreeRandomCell(length, grid);
-        }
-
-        grid[row][col] = 1;
-      };
+      const getFreeRandomCell = (length: number, grid: number[][]) => {};
 
       const requiredCellsAmount = (cells / 100) * percent;

[Killed] ConditionalExpression
src/hooks/grid.hook.tsx:77:13
         const col = getRandomInt(length);
         const row = getRandomInt(length);
 
-        if (grid[row][col] === 1) {
+        if (true) {
           getFreeRandomCell(length, grid);
         }
killedBy: testing useGrid hook test start & stop simulation
statusReason: RangeError: Maximum call stack size exceeded

[Killed] EqualityOperator
src/hooks/grid.hook.tsx:77:13
         const col = getRandomInt(length);
         const row = getRandomInt(length);
 
-        if (grid[row][col] === 1) {
+        if (grid[row][col] !== 1) {
           getFreeRandomCell(length, grid);
         }
killedBy: Sidebar tests change range Input
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ArithmeticOperator
src/hooks/grid.hook.tsx:84:36
         grid[row][col] = 1;
       };
 
-      const requiredCellsAmount = (cells / 100) * percent;
+      const requiredCellsAmount = (cells * 100) * percent;
       generateEmptyGrid();
       setGrid((g) =>
killedBy: testing useGrid hook test start & stop simulation
statusReason: RangeError: Maximum call stack size exceeded

[Survived] ArithmeticOperator
src/hooks/grid.hook.tsx:84:35
         grid[row][col] = 1;
       };
 
-      const requiredCellsAmount = (cells / 100) * percent;
+      const requiredCellsAmount = cells / 100 / percent;
       generateEmptyGrid();
       setGrid((g) =>

[Killed] ArrowFunction
src/hooks/grid.hook.tsx:86:15
 
       const requiredCellsAmount = (cells / 100) * percent;
       generateEmptyGrid();
-      setGrid((g) =>
-        produce(g, (newGrid) => {
-          for (let i = 0; i < requiredCellsAmount; i++) {
-            getFreeRandomCell(size[0], newGrid);
-          }
-        })
+      setGrid(() => undefined
       );
     },
killedBy: testing useGrid hook test start & stop simulation
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] BlockStatement
src/hooks/grid.hook.tsx:87:33
       const requiredCellsAmount = (cells / 100) * percent;
       generateEmptyGrid();
       setGrid((g) =>
-        produce(g, (newGrid) => {
-          for (let i = 0; i < requiredCellsAmount; i++) {
-            getFreeRandomCell(size[0], newGrid);
-          }
-        })
+        produce(g, (newGrid) => {})
       );
     },

[Killed] UpdateOperator
src/hooks/grid.hook.tsx:88:52
       generateEmptyGrid();
       setGrid((g) =>
         produce(g, (newGrid) => {
-          for (let i = 0; i < requiredCellsAmount; i++) {
+          for (let i = 0; i < requiredCellsAmount; i--) {
             getFreeRandomCell(size[0], newGrid);
           }
killedBy: Sidebar tests change range Input
statusReason: RangeError: Maximum call stack size exceeded

[Survived] ConditionalExpression
src/hooks/grid.hook.tsx:88:27
       generateEmptyGrid();
       setGrid((g) =>
         produce(g, (newGrid) => {
-          for (let i = 0; i < requiredCellsAmount; i++) {
+          for (let i = 0; false; i++) {
             getFreeRandomCell(size[0], newGrid);
           }

[Survived] ArrayDeclaration
src/hooks/grid.hook.tsx:94:5
         })
       );
     },
-    [generateEmptyGrid, size]
+    []
   );
 

[Survived] BlockStatement
src/hooks/grid.hook.tsx:105:35
 
   runningRef.current = running;
 
-  const start = useCallback(() => {
-    const runSimulation = () => {
-      if (!runningRef.current) return;
-      regenerateGrid();
-      setTimeout(runSimulation, speedRef.current);
-    };
-    if (!running) {
-      setRunning(() => true);
-      runningRef.current = true;
-      runSimulation();
-    } else {
-      setRunning(() => false);
-      runningRef.current = false;
-    }
-  }, [running, regenerateGrid]);
+  const start = useCallback(() => {}, [running, regenerateGrid]);
 
   const clear = useCallback(() => {

[Survived] BlockStatement
src/hooks/grid.hook.tsx:106:33
   runningRef.current = running;
 
   const start = useCallback(() => {
-    const runSimulation = () => {
-      if (!runningRef.current) return;
-      regenerateGrid();
-      setTimeout(runSimulation, speedRef.current);
-    };
+    const runSimulation = () => {};
     if (!running) {
       setRunning(() => true);

[Survived] ConditionalExpression
src/hooks/grid.hook.tsx:107:11
 
   const start = useCallback(() => {
     const runSimulation = () => {
-      if (!runningRef.current) return;
+      if (false) return;
       regenerateGrid();
       setTimeout(runSimulation, speedRef.current);

[Survived] ConditionalExpression
src/hooks/grid.hook.tsx:107:11
 
   const start = useCallback(() => {
     const runSimulation = () => {
-      if (!runningRef.current) return;
+      if (true) return;
       regenerateGrid();
       setTimeout(runSimulation, speedRef.current);

[Survived] ConditionalExpression
src/hooks/grid.hook.tsx:111:9
       regenerateGrid();
       setTimeout(runSimulation, speedRef.current);
     };
-    if (!running) {
+    if (false) {
       setRunning(() => true);
       runningRef.current = true;

[Survived] BooleanLiteral
src/hooks/grid.hook.tsx:111:9
       regenerateGrid();
       setTimeout(runSimulation, speedRef.current);
     };
-    if (!running) {
+    if (running) {
       setRunning(() => true);
       runningRef.current = true;

[Survived] BooleanLiteral
src/hooks/grid.hook.tsx:112:24
       setTimeout(runSimulation, speedRef.current);
     };
     if (!running) {
-      setRunning(() => true);
+      setRunning(() => false);
       runningRef.current = true;
       runSimulation();

[Survived] ArrowFunction
src/hooks/grid.hook.tsx:112:18
       setTimeout(runSimulation, speedRef.current);
     };
     if (!running) {
-      setRunning(() => true);
+      setRunning(() => undefined);
       runningRef.current = true;
       runSimulation();

[Survived] BooleanLiteral
src/hooks/grid.hook.tsx:113:28
     };
     if (!running) {
       setRunning(() => true);
-      runningRef.current = true;
+      runningRef.current = false;
       runSimulation();
     } else {

[Survived] BlockStatement
src/hooks/grid.hook.tsx:115:12
       setRunning(() => true);
       runningRef.current = true;
       runSimulation();
-    } else {
-      setRunning(() => false);
-      runningRef.current = false;
-    }
+    } else {}
   }, [running, regenerateGrid]);
 

[Survived] ArrowFunction
src/hooks/grid.hook.tsx:116:18
       runningRef.current = true;
       runSimulation();
     } else {
-      setRunning(() => false);
+      setRunning(() => undefined);
       runningRef.current = false;
     }

[NoCoverage] BooleanLiteral
src/hooks/grid.hook.tsx:116:24
       runningRef.current = true;
       runSimulation();
     } else {
-      setRunning(() => false);
+      setRunning(() => true);
       runningRef.current = false;
     }

[Survived] BooleanLiteral
src/hooks/grid.hook.tsx:117:28
       runSimulation();
     } else {
       setRunning(() => false);
-      runningRef.current = false;
+      runningRef.current = true;
     }
   }, [running, regenerateGrid]);

[Survived] BlockStatement
src/hooks/grid.hook.tsx:121:35
     }
   }, [running, regenerateGrid]);
 
-  const clear = useCallback(() => {
-    setRunning(() => false);
-    runningRef.current = false;
-    generateEmptyGrid();
-  }, [generateEmptyGrid]);
+  const clear = useCallback(() => {}, [generateEmptyGrid]);
 
   const changeSpeed = useCallback((v: number) => {

[Survived] ArrowFunction
src/hooks/grid.hook.tsx:122:16
   }, [running, regenerateGrid]);
 
   const clear = useCallback(() => {
-    setRunning(() => false);
+    setRunning(() => undefined);
     runningRef.current = false;
     generateEmptyGrid();

[Survived] BooleanLiteral
src/hooks/grid.hook.tsx:122:22
   }, [running, regenerateGrid]);
 
   const clear = useCallback(() => {
-    setRunning(() => false);
+    setRunning(() => true);
     runningRef.current = false;
     generateEmptyGrid();

[Survived] BlockStatement
src/hooks/grid.hook.tsx:127:50
     generateEmptyGrid();
   }, [generateEmptyGrid]);
 
-  const changeSpeed = useCallback((v: number) => {
-    setSpeed(() => v);
-    speedRef.current = v;
-  }, []);
+  const changeSpeed = useCallback((v: number) => {}, []);
 
   const handleItemClick = useCallback(

[Survived] ArrowFunction
src/hooks/grid.hook.tsx:128:14
   }, [generateEmptyGrid]);
 
   const changeSpeed = useCallback((v: number) => {
-    setSpeed(() => v);
+    setSpeed(() => undefined);
     speedRef.current = v;
   }, []);

[Survived] BlockStatement
src/hooks/grid.hook.tsx:133:31
   }, []);
 
   const handleItemClick = useCallback(
-    (i: number, k: number) => {
-      const newGrid = produce(grid, (gridCopy) => {
-        gridCopy[i][k] = grid[i][k] ? 0 : 1;
-      });
-      setGrid(newGrid);
-    },
+    (i: number, k: number) => {},
     [grid]
   );

[Survived] BlockStatement
src/hooks/grid.hook.tsx:134:51
 
   const handleItemClick = useCallback(
     (i: number, k: number) => {
-      const newGrid = produce(grid, (gridCopy) => {
-        gridCopy[i][k] = grid[i][k] ? 0 : 1;
-      });
+      const newGrid = produce(grid, (gridCopy) => {});
       setGrid(newGrid);
     },

[Survived] ArrayDeclaration
src/hooks/grid.hook.tsx:139:5
       });
       setGrid(newGrid);
     },
-    [grid]
+    []
   );
 

[Killed] ArrowFunction
src/hooks/grid.hook.tsx:144:15
 
   const setGridSize = useCallback(
     (x: number, y: number) => {
-      setSize(() => [x, y]);
+      setSize(() => undefined);
       let newGrid: number[][] = [];
       if (x <= size[0]) {
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
src/hooks/grid.hook.tsx:144:21
 
   const setGridSize = useCallback(
     (x: number, y: number) => {
-      setSize(() => [x, y]);
+      setSize(() => []);
       let newGrid: number[][] = [];
       if (x <= size[0]) {
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: RangeError: Invalid array length

[Killed] ConditionalExpression
src/hooks/grid.hook.tsx:146:11
     (x: number, y: number) => {
       setSize(() => [x, y]);
       let newGrid: number[][] = [];
-      if (x <= size[0]) {
+      if (true) {
         newGrid = produce(grid, (gCopy) => {
           gCopy = grid.slice(0, x);
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: Cannot add property 30, object is not extensible

[Killed] ConditionalExpression
src/hooks/grid.hook.tsx:146:11
     (x: number, y: number) => {
       setSize(() => [x, y]);
       let newGrid: number[][] = [];
-      if (x <= size[0]) {
+      if (false) {
         newGrid = produce(grid, (gCopy) => {
           gCopy = grid.slice(0, x);
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: RangeError: Invalid array length

[Survived] BlockStatement
src/hooks/grid.hook.tsx:147:44
       setSize(() => [x, y]);
       let newGrid: number[][] = [];
       if (x <= size[0]) {
-        newGrid = produce(grid, (gCopy) => {
-          gCopy = grid.slice(0, x);
-          for (let i = 0; i < x; i++) {
-            if (gCopy[i].length <= y) {
-              for (let k = gCopy[i].length; k < y; k++) {
-                gCopy[i].push(0);
-              }
-            } else {
-              gCopy[i] = gCopy[i].slice(0, y);
-            }
-          }
-          return gCopy;
-        });
+        newGrid = produce(grid, (gCopy) => {});
       } else {
         newGrid = produce(grid, (gCopy) => {

[Killed] MethodExpression
src/hooks/grid.hook.tsx:148:19
       let newGrid: number[][] = [];
       if (x <= size[0]) {
         newGrid = produce(grid, (gCopy) => {
-          gCopy = grid.slice(0, x);
+          gCopy = grid;
           for (let i = 0; i < x; i++) {
             if (gCopy[i].length <= y) {
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: Cannot assign to read only property '0' of object '[object Array]'

[Killed] EqualityOperator
src/hooks/grid.hook.tsx:149:27
       if (x <= size[0]) {
         newGrid = produce(grid, (gCopy) => {
           gCopy = grid.slice(0, x);
-          for (let i = 0; i < x; i++) {
+          for (let i = 0; i <= x; i++) {
             if (gCopy[i].length <= y) {
               for (let k = gCopy[i].length; k < y; k++) {
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] UpdateOperator
src/hooks/grid.hook.tsx:149:34
       if (x <= size[0]) {
         newGrid = produce(grid, (gCopy) => {
           gCopy = grid.slice(0, x);
-          for (let i = 0; i < x; i++) {
+          for (let i = 0; i < x; i--) {
             if (gCopy[i].length <= y) {
               for (let k = gCopy[i].length; k < y; k++) {
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[NoCoverage] BlockStatement
src/hooks/grid.hook.tsx:150:39
         newGrid = produce(grid, (gCopy) => {
           gCopy = grid.slice(0, x);
           for (let i = 0; i < x; i++) {
-            if (gCopy[i].length <= y) {
-              for (let k = gCopy[i].length; k < y; k++) {
-                gCopy[i].push(0);
-              }
-            } else {
+            if (gCopy[i].length <= y) {} else {
               gCopy[i] = gCopy[i].slice(0, y);
             }

[Survived] ConditionalExpression
src/hooks/grid.hook.tsx:150:17
         newGrid = produce(grid, (gCopy) => {
           gCopy = grid.slice(0, x);
           for (let i = 0; i < x; i++) {
-            if (gCopy[i].length <= y) {
+            if (true) {
               for (let k = gCopy[i].length; k < y; k++) {
                 gCopy[i].push(0);

[NoCoverage] EqualityOperator
src/hooks/grid.hook.tsx:151:45
           gCopy = grid.slice(0, x);
           for (let i = 0; i < x; i++) {
             if (gCopy[i].length <= y) {
-              for (let k = gCopy[i].length; k < y; k++) {
+              for (let k = gCopy[i].length; k >= y; k++) {
                 gCopy[i].push(0);
               }

[NoCoverage] ConditionalExpression
src/hooks/grid.hook.tsx:151:45
           gCopy = grid.slice(0, x);
           for (let i = 0; i < x; i++) {
             if (gCopy[i].length <= y) {
-              for (let k = gCopy[i].length; k < y; k++) {
+              for (let k = gCopy[i].length; false; k++) {
                 gCopy[i].push(0);
               }

[Survived] BlockStatement
src/hooks/grid.hook.tsx:154:20
               for (let k = gCopy[i].length; k < y; k++) {
                 gCopy[i].push(0);
               }
-            } else {
-              gCopy[i] = gCopy[i].slice(0, y);
-            }
+            } else {}
           }
           return gCopy;

[Survived] MethodExpression
src/hooks/grid.hook.tsx:155:26
                 gCopy[i].push(0);
               }
             } else {
-              gCopy[i] = gCopy[i].slice(0, y);
+              gCopy[i] = gCopy[i];
             }
           }

[Killed] BlockStatement
src/hooks/grid.hook.tsx:160:14
           }
           return gCopy;
         });
-      } else {
-        newGrid = produce(grid, (gCopy) => {
-          gCopy = [];
-          for (let i = 0; i < x; i++) {
-            if (i < grid.length) {
-              const col = produce(grid[i], (newRow) => {
-                newRow = [
-                  ...grid[i],
-                  ...Array.from(Array(y - grid[i].length), () => 0),
-                ];
-                return newRow;
-              });
-              gCopy[i] = col;
-            } else {
-              const col = Array.from(Array(y), () => 0);
-              gCopy.push(col);
-            }
-          }
-          return gCopy;
-        });
-      }
+      } else {}
       setGrid(() => newGrid);
     },
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: Cannot read properties of undefined (reading 'length')
