[Killed] BlockStatement
src/hooks/grid.hook.tsx:161:44
           return gCopy;
         });
       } else {
-        newGrid = produce(grid, (gCopy) => {
-          gCopy = [];
-          for (let i = 0; i < x; i++) {
-            if (i < grid.length) {
-              const col = produce(grid[i], (newRow) => {
-                newRow = [
-                  ...grid[i],
-                  ...Array.from(Array(y - grid[i].length), () => 0),
-                ];
-                return newRow;
-              });
-              gCopy[i] = col;
-            } else {
-              const col = Array.from(Array(y), () => 0);
-              gCopy.push(col);
-            }
-          }
-          return gCopy;
-        });
+        newGrid = produce(grid, (gCopy) => {});
       }
       setGrid(() => newGrid);
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: Cannot add property 30, object is not extensible

[Survived] ArrayDeclaration
src/hooks/grid.hook.tsx:162:19
         });
       } else {
         newGrid = produce(grid, (gCopy) => {
-          gCopy = [];
+          gCopy = ["Stryker was here"];
           for (let i = 0; i < x; i++) {
             if (i < grid.length) {

[Killed] BlockStatement
src/hooks/grid.hook.tsx:163:39
       } else {
         newGrid = produce(grid, (gCopy) => {
           gCopy = [];
-          for (let i = 0; i < x; i++) {
-            if (i < grid.length) {
-              const col = produce(grid[i], (newRow) => {
-                newRow = [
-                  ...grid[i],
-                  ...Array.from(Array(y - grid[i].length), () => 0),
-                ];
-                return newRow;
-              });
-              gCopy[i] = col;
-            } else {
-              const col = Array.from(Array(y), () => 0);
-              gCopy.push(col);
-            }
-          }
+          for (let i = 0; i < x; i++) {}
           return gCopy;
         });
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] UpdateOperator
src/hooks/grid.hook.tsx:163:34
       } else {
         newGrid = produce(grid, (gCopy) => {
           gCopy = [];
-          for (let i = 0; i < x; i++) {
+          for (let i = 0; i < x; i--) {
             if (i < grid.length) {
               const col = produce(grid[i], (newRow) => {
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] EqualityOperator
src/hooks/grid.hook.tsx:164:17
         newGrid = produce(grid, (gCopy) => {
           gCopy = [];
           for (let i = 0; i < x; i++) {
-            if (i < grid.length) {
+            if (i >= grid.length) {
               const col = produce(grid[i], (newRow) => {
                 newRow = [
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/hooks/grid.hook.tsx:164:17
         newGrid = produce(grid, (gCopy) => {
           gCopy = [];
           for (let i = 0; i < x; i++) {
-            if (i < grid.length) {
+            if (true) {
               const col = produce(grid[i], (newRow) => {
                 newRow = [
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/hooks/grid.hook.tsx:165:56
           gCopy = [];
           for (let i = 0; i < x; i++) {
             if (i < grid.length) {
-              const col = produce(grid[i], (newRow) => {
-                newRow = [
-                  ...grid[i],
-                  ...Array.from(Array(y - grid[i].length), () => 0),
-                ];
-                return newRow;
-              });
+              const col = produce(grid[i], (newRow) => {});
               gCopy[i] = col;
             } else {
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: Cannot add property 30, object is not extensible

[Killed] ArrayDeclaration
src/hooks/grid.hook.tsx:166:26
           for (let i = 0; i < x; i++) {
             if (i < grid.length) {
               const col = produce(grid[i], (newRow) => {
-                newRow = [
-                  ...grid[i],
-                  ...Array.from(Array(y - grid[i].length), () => 0),
-                ];
+                newRow = [];
                 return newRow;
               });
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: Cannot add property 0, object is not extensible

[Survived] ArithmeticOperator
src/hooks/grid.hook.tsx:168:39
               const col = produce(grid[i], (newRow) => {
                 newRow = [
                   ...grid[i],
-                  ...Array.from(Array(y - grid[i].length), () => 0),
+                  ...Array.from(Array(y + grid[i].length), () => 0),
                 ];
                 return newRow;

[Survived] ArrowFunction
src/hooks/grid.hook.tsx:168:60
               const col = produce(grid[i], (newRow) => {
                 newRow = [
                   ...grid[i],
-                  ...Array.from(Array(y - grid[i].length), () => 0),
+                  ...Array.from(Array(y - grid[i].length), () => undefined),
                 ];
                 return newRow;

[Killed] BlockStatement
src/hooks/grid.hook.tsx:173:20
                 return newRow;
               });
               gCopy[i] = col;
-            } else {
-              const col = Array.from(Array(y), () => 0);
-              gCopy.push(col);
-            }
+            } else {}
           }
           return gCopy;
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Survived] ArrowFunction
src/hooks/grid.hook.tsx:174:48
               });
               gCopy[i] = col;
             } else {
-              const col = Array.from(Array(y), () => 0);
+              const col = Array.from(Array(y), () => undefined);
               gCopy.push(col);
             }

[Killed] ArrowFunction
src/hooks/grid.hook.tsx:181:15
           return gCopy;
         });
       }
-      setGrid(() => newGrid);
+      setGrid(() => undefined);
     },
     [grid, size, setSize, setGrid]
killedBy: Sidebar tests test size btns clicks and hook logic
statusReason: TypeError: Cannot read properties of undefined (reading 'length')
