[NoCoverage] StringLiteral
src/index.tsx:11:43
 import { GridProvider } from "./hooks/grid.hook";
 import "./output.css";
 
-const container = document.getElementById("root");
+const container = document.getElementById("");
 const root = createRoot(container!);
 root.render(
