[Survived] BlockStatement
src/store/store.ts:7:33
 import createSagaMiddleware from "redux-saga";
 import rootSaga from "./saga";
 
-const getPreloadedState = () => {
-  let state;
-
-  try {
-    const value = localStorage.getItem("userName");
-    state = value ? { auth: { authed: true, user: JSON.parse(value) } } : { auth: { authed: false, user: "" } };
-  } catch (e) {}
-
-  return state;
-};
+const getPreloadedState = () => {};
 
 const sagaMiddleware = createSagaMiddleware();

[Survived] BlockStatement
src/store/store.ts:10:7
 const getPreloadedState = () => {
   let state;
 
-  try {
-    const value = localStorage.getItem("userName");
-    state = value ? { auth: { authed: true, user: JSON.parse(value) } } : { auth: { authed: false, user: "" } };
-  } catch (e) {}
+  try {} catch (e) {}
 
   return state;

[NoCoverage] BooleanLiteral
src/store/store.ts:12:39
 
   try {
     const value = localStorage.getItem("userName");
-    state = value ? { auth: { authed: true, user: JSON.parse(value) } } : { auth: { authed: false, user: "" } };
+    state = value ? { auth: { authed: false, user: JSON.parse(value) } } : { auth: { authed: false, user: "" } };
   } catch (e) {}
 

[Survived] BooleanLiteral
src/store/store.ts:12:93
 
   try {
     const value = localStorage.getItem("userName");
-    state = value ? { auth: { authed: true, user: JSON.parse(value) } } : { auth: { authed: false, user: "" } };
+    state = value ? { auth: { authed: true, user: JSON.parse(value) } } : { auth: { authed: true, user: "" } };
   } catch (e) {}
 
