[NoCoverage] ArrowFunction
src/stories/Field.stories.tsx:16:48
   },
 } as ComponentMeta<typeof Field>;
 
-const Template: ComponentStory<typeof Field> = () => (
-  <GridProvider>
-    <Field />
-  </GridProvider>
-);
+const Template: ComponentStory<typeof Field> = () => undefined;
 
 export const NormalField = Template;
