[NoCoverage] ArrowFunction
src/stories/FieldItem.stories.tsx:15:52
   },
 } as ComponentMeta<typeof FieldItem>;
 
-const Template: ComponentStory<typeof FieldItem> = (args) => (
-  <FieldItem {...args} />
-);
+const Template: ComponentStory<typeof FieldItem> = () => undefined;
 
 export const NormalFieldItem = Template.bind({});

[NoCoverage] ObjectLiteral
src/stories/FieldItem.stories.tsx:21:24
 
 export const NormalFieldItem = Template.bind({});
 
-NormalFieldItem.args = {
-  handleClick: () => {
-    // do nothing
-  },
-  itemValue: 0,
-};
+NormalFieldItem.args = {};
 
 export const ClickedFieldItem = Template.bind({});
