[NoCoverage] ArrowFunction
src/stories/Header.stories.tsx:19:49
   },
 } as ComponentMeta<typeof Header>;
 
-const Template: ComponentStory<typeof Header> = () => (
-  <Router>
-    <Provider store={store}>
-      <GridProvider>
-        <Header />
-      </GridProvider>
-    </Provider>
-  </Router>
-);
+const Template: ComponentStory<typeof Header> = () => undefined;
 
 export const NormalHeader = Template;
