[NoCoverage] ArrowFunction
src/stories/Page.stories.tsx:18:47
   },
 } as ComponentMeta<typeof Page>;
 
-const Template: ComponentStory<typeof Page> = (args) => (
-  <Router>
-    <Provider store={store}>
-      <GridProvider>
-        <Page {...args} />
-      </GridProvider>
-    </Provider>
-  </Router>
-);
+const Template: ComponentStory<typeof Page> = () => undefined;
 
 export const NormalPage = Template.bind({});
