[NoCoverage] ObjectLiteral
src/stories/Preview.js:6:12
 import "../src/index.css";
 
 export const parameters = {
-  actions: { argTypesRegex: "^on[A-Z].*" },
+  actions: {},
   controls: {
     matchers: {

[NoCoverage] StringLiteral
src/stories/Preview.js:6:29
 import "../src/index.css";
 
 export const parameters = {
-  actions: { argTypesRegex: "^on[A-Z].*" },
+  actions: { argTypesRegex: "" },
   controls: {
     matchers: {

[NoCoverage] Regex
src/stories/Preview.js:9:14
   actions: { argTypesRegex: "^on[A-Z].*" },
   controls: {
     matchers: {
-      color: /(background|color)$/i,
+      color: /(background|color)/i,
       date: /Date$/,
     },

[NoCoverage] ObjectLiteral
src/stories/Preview.js:13:16
       date: /Date$/,
     },
   },
-  previewTabs: {
-    "storybook/docs/panel": { index: -1 },
-  },
+  previewTabs: {},
 };
 

[NoCoverage] UnaryOperator
src/stories/Preview.js:14:38
     },
   },
   previewTabs: {
-    "storybook/docs/panel": { index: -1 },
+    "storybook/docs/panel": { index: +1 },
   },
 };

[NoCoverage] ObjectLiteral
src/stories/Preview.js:14:29
     },
   },
   previewTabs: {
-    "storybook/docs/panel": { index: -1 },
+    "storybook/docs/panel": {},
   },
 };
