[NoCoverage] ArrowFunction
src/stories/Sidebar.stories.tsx:16:50
   },
 } as ComponentMeta<typeof Sidebar>;
 
-const Template: ComponentStory<typeof Sidebar> = () => <GridProvider><Sidebar /></GridProvider>;
+const Template: ComponentStory<typeof Sidebar> = () => undefined;
 
 export const NormalLoginForm = Template;
