[NoCoverage] ObjectLiteral
src/__mocks__/axios.js:1:18
-module.exports = {
-  get: () => {
-    return Promise.resolve({
-      data: [
-        {
-          id: 0,
-          title: "Wash the dishes",
-          userId: 1,
-          competed: true,
-        },
-        {
-          id: 1,
-          title: "Make the bed",
-          userId: 1,
-          competed: true,
-        },
-      ],
-    });
-  },
-};
+module.exports = {};
 

[NoCoverage] BlockStatement
src/__mocks__/axios.js:2:14
 module.exports = {
-  get: () => {
-    return Promise.resolve({
-      data: [
-        {
-          id: 0,
-          title: "Wash the dishes",
-          userId: 1,
-          competed: true,
-        },
-        {
-          id: 1,
-          title: "Make the bed",
-          userId: 1,
-          competed: true,
-        },
-      ],
-    });
-  },
+  get: () => {},
 };
 

[NoCoverage] BooleanLiteral
src/__mocks__/axios.js:9:21
           id: 0,
           title: "Wash the dishes",
           userId: 1,
-          competed: true,
+          competed: false,
         },
         {
