[Killed] BlockStatement
src/components/Page/Page.tsx:9:42
 import { useNavigate } from "react-router-dom";
 
 /* eslint-disable react/display-name */
-export const Page: React.FC = memo(() => {
-  const navigate = useNavigate();
-  const { authed } = useAppSelector((state) => state.auth);
-
-  useEffect(() => {    
-    if (!authed) navigate("/login");
-  }, [navigate, authed]);
-  return (
-    <div className="h-screen">
-      <Header />
-      <section className="h-full flex gap-5">
-        <Sidebar />
-        <Field />
-      </section>
-    </div>
-  );
-});
+export const Page: React.FC = memo(() => {});
 
killedBy: test Page component renders Page component
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: undefined

[Killed] ArrowFunction
src/components/Page/Page.tsx:11:37
 /* eslint-disable react/display-name */
 export const Page: React.FC = memo(() => {
   const navigate = useNavigate();
-  const { authed } = useAppSelector((state) => state.auth);
+  const { authed } = useAppSelector(() => undefined);
 
   useEffect(() => {    
killedBy: test Page component renders Page component
statusReason: TypeError: Cannot read properties of undefined (reading 'authed')

[Survived] BlockStatement
src/components/Page/Page.tsx:13:19
   const navigate = useNavigate();
   const { authed } = useAppSelector((state) => state.auth);
 
-  useEffect(() => {    
-    if (!authed) navigate("/login");
-  }, [navigate, authed]);
+  useEffect(() => {}, [navigate, authed]);
   return (
     <div className="h-screen">

[Survived] BooleanLiteral
src/components/Page/Page.tsx:14:9
   const { authed } = useAppSelector((state) => state.auth);
 
   useEffect(() => {    
-    if (!authed) navigate("/login");
+    if (authed) navigate("/login");
   }, [navigate, authed]);
   return (

[Survived] ConditionalExpression
src/components/Page/Page.tsx:14:9
   const { authed } = useAppSelector((state) => state.auth);
 
   useEffect(() => {    
-    if (!authed) navigate("/login");
+    if (true) navigate("/login");
   }, [navigate, authed]);
   return (

[Survived] ArrayDeclaration
src/components/Page/Page.tsx:15:6
 
   useEffect(() => {    
     if (!authed) navigate("/login");
-  }, [navigate, authed]);
+  }, []);
   return (
     <div className="h-screen">
