[Survived] StringLiteral
src/components/Sidebar/Sidebar.tsx:6:56
 import { useGrid } from "../../hooks/grid.hook";
 
 export const Sidebar = () => {
-  const [rangeValue, setRangeValue] = useState<string>("0");
+  const [rangeValue, setRangeValue] = useState<string>("");
   const { start, clear, running, changeSpeed, setGridSize, fillRandomCells } =
     useGrid();

[Survived] StringLiteral
src/components/Sidebar/Sidebar.tsx:15:5
 
   const btnStyle = classNames(
     defaultBtn,
-    `${running ? "bg-red-300" : "bg-green-300"}`
+    ``
   );
 

[Killed] BlockStatement
src/components/Sidebar/Sidebar.tsx:22:67
 
   const purpleBtn = classNames(defaultBtn, `bg-purple-300`);
 
-  const changeRange = (e: React.ChangeEvent<HTMLInputElement>) => {
-    setRangeValue(() => e.target.value);
-    fillRandomCells(+e.target.value);
-  };
+  const changeRange = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
   const handleClearClick = () => {
killedBy: Sidebar tests change range Input
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  60 %
Received:
  0 %

[Killed] ArrowFunction
src/components/Sidebar/Sidebar.tsx:23:19
   const purpleBtn = classNames(defaultBtn, `bg-purple-300`);
 
   const changeRange = (e: React.ChangeEvent<HTMLInputElement>) => {
-    setRangeValue(() => e.target.value);
+    setRangeValue(() => undefined);
     fillRandomCells(+e.target.value);
   };
killedBy: Sidebar tests change range Input
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  60 %
Received:
  undefined %

[Survived] UnaryOperator
src/components/Sidebar/Sidebar.tsx:24:21
 
   const changeRange = (e: React.ChangeEvent<HTMLInputElement>) => {
     setRangeValue(() => e.target.value);
-    fillRandomCells(+e.target.value);
+    fillRandomCells(-e.target.value);
   };
 

[Survived] BlockStatement
src/components/Sidebar/Sidebar.tsx:27:34
     fillRandomCells(+e.target.value);
   };
 
-  const handleClearClick = () => {
-    clear();
-    setRangeValue(() => "0");
-  };
+  const handleClearClick = () => {};
 
   return (

[Killed] ArrowFunction
src/components/Sidebar/Sidebar.tsx:29:19
 
   const handleClearClick = () => {
     clear();
-    setRangeValue(() => "0");
+    setRangeValue(() => undefined);
   };
 
killedBy: Sidebar tests change range Input
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  0 %
Received:
  undefined %

[Killed] StringLiteral
src/components/Sidebar/Sidebar.tsx:29:25
 
   const handleClearClick = () => {
     clear();
-    setRangeValue(() => "0");
+    setRangeValue(() => "");
   };
 
killedBy: Sidebar tests change range Input
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  0 %
Received:
  %

[Killed] StringLiteral
src/components/Sidebar/Sidebar.tsx:37:33
       <div className="mx-auto flex flex-col w-[300px] gap-3 bg-slate-100 rounded-2xl p-3">
         <fieldset className="flex flex-col gap-2">
           <button onClick={start} className={btnStyle}>
-            {running ? "Стоп" : "Старт"}
+            {running ? "Стоп" : ""}
           </button>
 
killedBy: Sidebar tests render UI elements
statusReason: Error: Unable to find an element with the text: /Старт/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="mx-auto flex flex-col w-[300px] gap-3 bg-slate-100 rounded-2xl p-3"

[Survived] ArrowFunction
src/components/Sidebar/Sidebar.tsx:47:28
 
         <fieldset className="flex flex-col gap-2">
           <legend>Скорость</legend>
-          <button onClick={() => changeSpeed(1000)} className={blueBtn}>
+          <button onClick={() => undefined} className={blueBtn}>
             1
           </button>

[Survived] ArrowFunction
src/components/Sidebar/Sidebar.tsx:51:28
             1
           </button>
 
-          <button onClick={() => changeSpeed(500)} className={blueBtn}>
+          <button onClick={() => undefined} className={blueBtn}>
             1.5
           </button>

[Survived] ArrowFunction
src/components/Sidebar/Sidebar.tsx:55:28
             1.5
           </button>
 
-          <button onClick={() => changeSpeed(200)} className={blueBtn}>
+          <button onClick={() => undefined} className={blueBtn}>
             2
           </button>

[Survived] StringLiteral
src/components/Sidebar/Sidebar.tsx:66:15
             disabled={running}
             className={classNames(
               purpleBtn,
-              "disabled:bg-gray-400 disabled:text-gray-600"
+              ""
             )}
             onClick={() => setGridSize(50, 50)}

[Survived] ArrowFunction
src/components/Sidebar/Sidebar.tsx:68:22
               purpleBtn,
               "disabled:bg-gray-400 disabled:text-gray-600"
             )}
-            onClick={() => setGridSize(50, 50)}
+            onClick={() => undefined}
           >
             50/50

[Survived] ArrowFunction
src/components/Sidebar/Sidebar.tsx:79:22
               purpleBtn,
               "disabled:bg-gray-400 disabled:text-gray-600"
             )}
-            onClick={() => setGridSize(30, 30)}
+            onClick={() => undefined}
           >
             30/30

[Survived] ArrowFunction
src/components/Sidebar/Sidebar.tsx:90:22
               purpleBtn,
               "disabled:bg-gray-400 disabled:text-gray-600"
             )}
-            onClick={() => setGridSize(100, 100)}
+            onClick={() => undefined}
           >
             100/100

[Killed] StringLiteral
src/components/Sidebar/Sidebar.tsx:104:16
               htmlFor="customRange1"
               className="form-label"
             >
-              {`${rangeValue} %`}
+              {``}
             </label>
             <input
killedBy: Sidebar tests change range Input
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  60 %
Received:
