[Survived] BlockStatement
src/store/saga/index.ts:4:37
 import { all } from "redux-saga/effects";
 import { authSaga } from "./authSaga";
 
-export default function* rootSaga() {
-  yield all([authSaga()]);
-}
+export default function* rootSaga() {}
