[Survived] UnaryOperator
src/utils/utils.ts:3:7
 export const operations = [
   [0, 1],
-  [0, -1],
+  [0, +1],
   [1, -1],
   [-1, 1],

[Survived] ArrayDeclaration
src/utils/utils.ts:3:3
 export const operations = [
   [0, 1],
-  [0, -1],
+  [],
   [1, -1],
   [-1, 1],

[Survived] UnaryOperator
src/utils/utils.ts:4:7
 export const operations = [
   [0, 1],
   [0, -1],
-  [1, -1],
+  [1, +1],
   [-1, 1],
   [1, 1],

[Survived] UnaryOperator
src/utils/utils.ts:5:4
   [0, 1],
   [0, -1],
   [1, -1],
-  [-1, 1],
+  [+1, 1],
   [1, 1],
   [-1, -1],

[Survived] ArrayDeclaration
src/utils/utils.ts:5:3
   [0, 1],
   [0, -1],
   [1, -1],
-  [-1, 1],
+  [],
   [1, 1],
   [-1, -1],

[Survived] UnaryOperator
src/utils/utils.ts:7:4
   [1, -1],
   [-1, 1],
   [1, 1],
-  [-1, -1],
+  [+1, -1],
   [1, 0],
   [-1, 0],

[Survived] UnaryOperator
src/utils/utils.ts:7:8
   [1, -1],
   [-1, 1],
   [1, 1],
-  [-1, -1],
+  [-1, +1],
   [1, 0],
   [-1, 0],

[Survived] UnaryOperator
src/utils/utils.ts:9:4
   [1, 1],
   [-1, -1],
   [1, 0],
-  [-1, 0],
+  [+1, 0],
 ];
 

[Killed] BlockStatement
src/utils/utils.ts:12:67
   [-1, 0],
 ];
 
-export const generateGrid = (numRows: number, numCols: number) => {
-  const rows: number[][] = [];
-  for (let i = 0; i < numRows; i++) {
-    const col: number[] = Array.from(Array(numCols), () => 0);
-    rows.push(col);
-  }
-  return rows;
-};
+export const generateGrid = (numRows: number, numCols: number) => {};
 
killedBy: Sidebar tests change range Input
statusReason: TypeError: Cannot read properties of undefined (reading '13')

[Killed] ConditionalExpression
src/utils/utils.ts:14:19
 
 export const generateGrid = (numRows: number, numCols: number) => {
   const rows: number[][] = [];
-  for (let i = 0; i < numRows; i++) {
+  for (let i = 0; false; i++) {
     const col: number[] = Array.from(Array(numCols), () => 0);
     rows.push(col);
killedBy: Sidebar tests change range Input
statusReason: TypeError: Cannot read properties of undefined (reading '44')

[Killed] EqualityOperator
src/utils/utils.ts:14:19
 
 export const generateGrid = (numRows: number, numCols: number) => {
   const rows: number[][] = [];
-  for (let i = 0; i < numRows; i++) {
+  for (let i = 0; i >= numRows; i++) {
     const col: number[] = Array.from(Array(numCols), () => 0);
     rows.push(col);
killedBy: Sidebar tests change range Input
statusReason: TypeError: Cannot read properties of undefined (reading '36')

[Survived] ArrowFunction
src/utils/utils.ts:15:54
 export const generateGrid = (numRows: number, numCols: number) => {
   const rows: number[][] = [];
   for (let i = 0; i < numRows; i++) {
-    const col: number[] = Array.from(Array(numCols), () => 0);
+    const col: number[] = Array.from(Array(numCols), () => undefined);
     rows.push(col);
   }
