[Killed] BlockStatement
src/components/Field/Field.tsx:17:28
   grid-template-rows: repeat(${(props) => props.numRows}, 15px);
 `;
 
-export const Field = () => {
-  const { grid, size, handleItemClick } = useGrid();
-
-  const props = {
-    numRows: size[0],
-    numCols: size[1],
-  };
-
-  return (
-    <Grid {...props} data-testid="grid">
-      {grid?.map((rows, i) =>
-        rows.map((col, k) => (
-          <FieldItem
-            key={`${i}-${k}`}
-            handleClick={() => {
-              handleItemClick(i, k);
-            }}
-            itemValue={grid[i][k]}
-          />
-        ))
-      )}
-    </Grid>
-  );
-};
+export const Field = () => {};
 
killedBy: test Field component renders Field component
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="grid"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ArrowFunction
src/components/Field/Field.tsx:27:18
 
   return (
     <Grid {...props} data-testid="grid">
-      {grid?.map((rows, i) =>
-        rows.map((col, k) => (
-          <FieldItem
-            key={`${i}-${k}`}
-            handleClick={() => {
-              handleItemClick(i, k);
-            }}
-            itemValue={grid[i][k]}
-          />
-        ))
+      {grid?.map(() => undefined
       )}
     </Grid>

[Survived] ArrowFunction
src/components/Field/Field.tsx:28:18
   return (
     <Grid {...props} data-testid="grid">
       {grid?.map((rows, i) =>
-        rows.map((col, k) => (
-          <FieldItem
-            key={`${i}-${k}`}
-            handleClick={() => {
-              handleItemClick(i, k);
-            }}
-            itemValue={grid[i][k]}
-          />
-        ))
+        rows.map(() => undefined)
       )}
     </Grid>

[Survived] StringLiteral
src/components/Field/Field.tsx:30:18
       {grid?.map((rows, i) =>
         rows.map((col, k) => (
           <FieldItem
-            key={`${i}-${k}`}
+            key={``}
             handleClick={() => {
               handleItemClick(i, k);
