[Killed] ArrowFunction
src/components/Header/Header.tsx:7:43
 import { RootState } from "../../store/store";
 
 export const Header = () => {
-  const { user, authed } = useAppSelector((state: RootState) => state.auth);
+  const { user, authed } = useAppSelector(() => undefined);
   const dispatch = useAppDispatch();
   
killedBy: test Page component renders Page component
statusReason: TypeError: Cannot read properties of undefined (reading 'user')

[Survived] LogicalOperator
src/components/Header/Header.tsx:17:10
           <h1>Game of Life</h1>
         </div>
 
-        {authed && (
-          <div className="flex gap-2 items-center">
-            <span className="font-semibold">Hi, {user}!</span>
-            <button
-              className="p-1 border border-green-500 text-green-500 uppercase rounded-lg text-sm"
-              onClick={() => dispatch(logout())}
-            >
-              Log out
-            </button>
-          </div>
-        )}
+        {authed || <div className="flex gap-2 items-center">
+            <span className="font-semibold">Hi, {user}!</span>
+            <button className="p-1 border border-green-500 text-green-500 uppercase rounded-lg text-sm" onClick={() => dispatch(logout())}>
+              Log out
+            </button>
+          </div>}
       </div>
     </header>

[Survived] ConditionalExpression
src/components/Header/Header.tsx:17:10
           <h1>Game of Life</h1>
         </div>
 
-        {authed && (
-          <div className="flex gap-2 items-center">
-            <span className="font-semibold">Hi, {user}!</span>
-            <button
-              className="p-1 border border-green-500 text-green-500 uppercase rounded-lg text-sm"
-              onClick={() => dispatch(logout())}
-            >
-              Log out
-            </button>
-          </div>
-        )}
+        {false}
       </div>
     </header>
