[NoCoverage] BlockStatement
src/hooks/grid.hook.tsx:44:43
   const regenerateGrid = useCallback(() => {
     setGrid((g) =>
       produce(g, (newGrid) => {
-        for (let i = 0; i < size[0]; i++) {
-          for (let k = 0; k < size[1]; k++) {
-            let neighbors = 0;
-            operations.forEach(([x, y]) => {
-              const newI = i + x;
-              const newK = k + y;
-              if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {
-                neighbors += g[newI][newK];
-              }
-            });
-
-            if (neighbors < 2 || neighbors > 3) {
-              newGrid[i][k] = 0;
-            } else if (g[i][k] === 0 && neighbors === 3) {
-              newGrid[i][k] = 1;
-            }
-          }
-        }
+        for (let i = 0; i < size[0]; i++) {}
       })
     );

[NoCoverage] BlockStatement
src/hooks/grid.hook.tsx:50:79
             operations.forEach(([x, y]) => {
               const newI = i + x;
               const newK = k + y;
-              if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {
-                neighbors += g[newI][newK];
-              }
+              if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {}
             });
 

[NoCoverage] EqualityOperator
src/hooks/grid.hook.tsx:50:50
             operations.forEach(([x, y]) => {
               const newI = i + x;
               const newK = k + y;
-              if (newI >= 0 && newI < size[0] && newK >= 0 && newK < size[1]) {
+              if (newI >= 0 && newI < size[0] && newK > 0 && newK < size[1]) {
                 neighbors += g[newI][newK];
               }

[NoCoverage] EqualityOperator
src/hooks/grid.hook.tsx:149:27
       if (x <= size[0]) {
         newGrid = produce(grid, (gCopy) => {
           gCopy = grid.slice(0, x);
-          for (let i = 0; i < x; i++) {
+          for (let i = 0; i >= x; i++) {
             if (gCopy[i].length <= y) {
               for (let k = gCopy[i].length; k < y; k++) {

[NoCoverage] ConditionalExpression
src/hooks/grid.hook.tsx:164:17
         newGrid = produce(grid, (gCopy) => {
           gCopy = [];
           for (let i = 0; i < x; i++) {
-            if (i < grid.length) {
+            if (false) {
               const col = produce(grid[i], (newRow) => {
                 newRow = [

[NoCoverage] BlockStatement
src/hooks/grid.hook.tsx:164:34
         newGrid = produce(grid, (gCopy) => {
           gCopy = [];
           for (let i = 0; i < x; i++) {
-            if (i < grid.length) {
-              const col = produce(grid[i], (newRow) => {
-                newRow = [
-                  ...grid[i],
-                  ...Array.from(Array(y - grid[i].length), () => 0),
-                ];
-                return newRow;
-              });
-              gCopy[i] = col;
-            } else {
+            if (i < grid.length) {} else {
               const col = Array.from(Array(y), () => 0);
               gCopy.push(col);

[Killed] ArrowFunction
src/hooks/grid.hook.tsx:187:5
   );
 
   const value = useMemo(
-    () => ({
-      clear,
-      grid,
-      setGridSize,
-      start,
-      running,
-      handleItemClick,
-      size,
-      changeSpeed,
-      fillRandomCells,
-      regenerateGrid,
-      speed,
-    }),
+    () => undefined,
     [
       clear,
killedBy: test Page component renders Page component
statusReason: TypeError: Cannot read properties of undefined (reading 'start')

[Killed] BlockStatement
src/hooks/grid.hook.tsx:218:30
   return <GridContext.Provider value={value}>{children}</GridContext.Provider>;
 };
 
-export const useGrid = () => {
-  return useContext(GridContext);
-};
+export const useGrid = () => {};
 
killedBy: test Page component renders Page component
statusReason: TypeError: Cannot read properties of undefined (reading 'start')
