[Killed] ArrayDeclaration
src/utils/utils.ts:13:28
 ];
 
 export const generateGrid = (numRows: number, numCols: number) => {
-  const rows: number[][] = [];
+  const rows: number[][] = ["Stryker was here"];
   for (let i = 0; i < numRows; i++) {
     const col: number[] = Array.from(Array(numCols), () => 0);
killedBy: test Page component renders Page component
statusReason: TypeError: rows.map is not a function
